-- Заполнение таблиц базы данных

-- таблица изданий
insert into editions (publication_index, publication_type, name, price, subscribe_date, duration)
values ('0123ABCD', 'газета', 'Комсомольская правда', 50, '2022-01-01', 12),
       ('4567EFGH', 'журнал', 'National Geographic', 150, '2022-02-01', 6),
       ('89IJKLNM', 'каталог', 'Lamoda', 1300, '2022-03-01', 1),
       ('OPQRSTUW', 'альманах', 'Лучшие сочинения', 300, '2022-04-01', 3),
       ('VWXYZ012', 'газета', 'Ведомости', 100, '2022-05-01', 12),
       ('3456ABCD', 'журнал', 'Forbes', 200, '2022-06-01', 6),
       ('7890EFGH', 'каталог', 'Wildberries', 1200, '2022-07-01', 1),
       ('1IJKLNM2', 'альманах', 'Портреты великих', 250, '2022-08-01', 3),
       ('3QRSTUW4', 'газета', 'Новая газета', 80, '2022-09-01', 12),
       ('5VWXYZ0', 'журнал', 'Cosmopolitan', 100, '2022-10-01', 6);