-- Заполнение таблиц базы данных Polyclinic.db

-- таблица персональных данных
insert into persons
(surname, [name], patronymic)
values ('Юрковский', 'Марк', 'Максимилианович'), /*  1 */
       ('Якубовская', 'Диана', 'Павловна'), /*  2 */
       ('Шапиро', 'Федор', 'Федорович'), /*  3 */
       ('Вожжаев', 'Сергей', 'Денисович'), /*  4 */
       ('Хроменко', 'Игорь', 'Владимирович'), /*  5 */
       ('Пелых', 'Марина', 'Ульяновна'), /*  6 */
       ('Лапотникова', 'Тамара', 'Оскаровна'), /*  7 */
       ('Огородников', 'Сергей', 'Иванович'), /*  8 */
       ('Яйло', 'Екатерина', 'Николаевна'), /*  9 */
       ('Лосева', 'Инна', 'Степановна'), /* 10 */
       ('Михайлович', 'Анна', 'Валентиновна'), /* 11 */
       ('Тарапата', 'Михаил', 'Исаакович'), /* 12 */
       ('Трубихин', 'Эдуард', 'Михайлович'), /* 13 */
       ('Чмыхало', 'Олег', 'Тарасович'), /* 14 */
       ('Князьков', 'Степан', 'Сидорович'), /* 15 */
       ('Потемкина', 'Наталья', 'Павловна'), /* 16 */
       ('Гритченко', 'Степан', 'Романович'), /* 17 */
       ('Селиванов', 'Александр', 'Михайлович'), /* 18 */
       ('Царькова', 'Лариса', 'Ильинична'), /* 19 */
       ('Яструб', 'Владимир', 'Данилович'), /* 20 */
       ('Мелашенко', 'Александр', 'Алексеевич'), /* 21 */
       ('Пономаренко', 'Владислов', 'Дмитриевич'), /* 22 */
       ('Хавалджи', 'Любовь', 'Амировна'), /* 23 */
       ('Пархоменко', 'Ирина', 'Владимировна'), /* 24 */
       ('Демидова', 'Алина', 'Александровна'), /* 25 */
       ('Лысенко', 'Елена', 'Егоровна'), /* 26 */
       ('Федосенко', 'Оксана', 'Владимировна'), /* 27 */
       ('Богатырева', 'Екатерина', 'Алексеевна'), /* 28 */
       ('Иванова', 'Валентина', 'Степановна'), /* 29 */
       ('Ильюшин', 'Сергей', 'Юрьевич');
/* 30 */


-- данные справочника врачебных специальностей
insert into specialities
(name)
values ('терапевт'), /*  1 */
       ('стоматолог'), /*  2 */
       ('окулист'), /*  3 */
       ('кардиолог'), /*  4 */
       ('пульманолог'), /*  5 */
       ('хирург'), /*  6 */
       ('акушер'), /*  7 */
       ('отоларинголог'), /*  8 */
       ('инфекционист'), /*  9 */
       ('физиотерпевт'), /* 10 */
       ('онколог'), /* 11 */
       ('венеролог'), /* 12 */
       ('уролог');
/* 13 */


-- данные таблицы докторов
insert into doctors
(id_person, id_speciality, price, [percent])
values (1, 1, 110, 5.0), /*  1 */
       (2, 2, 600, 3.0), /*  2 */
       (3, 1, 160, 3.5), /*  3 */
       (4, 1, 250, 3.2), /*  4 */
       (5, 3, 300, 4.5), /*  5 */
       (6, 2, 600, 4.5), /*  6 */
       (7, 4, 300, 4.0), /*  7 */
       (8, 5, 250, 3.5), /*  8 */
       (9, 6, 800, 5.1), /*  9 */
       (10, 6, 1300, 4.5), /* 10 */
       (11, 2, 350, 3.1), /* 11 */
       (12, 1, 120, 6.2);
/* 12 */


-- данные таблицы пациентов
insert into patients
(id_person, born_date, address, passport)
values (13, '2001-12-02', 'ул. Садовая, д. 123, кв. 12', 'ЕС45718'), /*  1 */
       (14, '1991-09-07', 'ул. Зайцева, д. 2', 'АВ34524'), /*  2 */
       (15, '1963-18-03', 'пр. Титова, д. 11, кв. 91', 'АТ65423'), /*  3 */
       (16, '1957-21-04', 'ул. Содовая, д. 9', 'ВО12312'), /*  4 */
       (17, '2001-12-02', 'ул. Челюскинцев, д. 112, кв. 211', 'СК67443'), /*  5 */
       (18, '1935-01-06', 'пр. Титова, д. 9, кв. 21', 'ВА12234'), /*  6 */
       (19, '1992-06-07', 'пл. Конституции, д. 3, кв. 75', 'СО54334'), /*  7 */
       (20, '1991-09-07', 'пр. Мира, д. 3, кв. 64', 'ВС89532'), /*  8 */
       (21, '1947-23-12', 'ул. Содовая, д. 9, кв. 6', 'СС34267'), /*  9 */
       (22, '1991-09-07', 'ул. Садовая, д. 10', 'АТ23414'), /* 10 */
       (23, '1956-29-09', 'ул. Судовая, д. 1, кв. 91', 'СО98751'), /* 11 */
       (24, '1963-13-04', 'пр. Титова, д. 31, кв. 42', 'ВА32456'), /* 12 */
       (25, '1957-21-04', 'ул. Челюскинцев, д. 3', 'ВО98412'), /* 13 */
       (26, '2001-12-02', 'пр. Содовая, д. 13', 'АТ15321'), /* 14 */
       (27, '2001-04-11', 'пл. Конституции, д. 1, кв. 50', 'СС75198'), /* 15 */
       (28, '2001-09-10', 'ул. Щорса, д. 23, кв. 17', 'ЕС98415'), /* 16 */
       (29, '1998-21-12', 'ул. Овнатаняна, д. 4, кв. 98', 'АВ51591'), /* 17 */
       (30, '1997-27-02', 'ул. Чкалова, д. 11', 'АТ57484');
/* 18 */


-- данные таблицы врачебных приемов 
insert into appointments
(appointment_date, id_patient, id_doctor)
values ('2022-10-21', 1, 1), /*  1 */
       ('2022-10-21', 2, 1), /*  2 */
       ('2022-10-21', 3, 2), /*  3 */
       ('2022-10-22', 4, 3), /*  4 */
       ('2022-10-22', 4, 5), /*  5 */
       ('2022-10-22', 3, 5), /*  6 */
       ('2022-12-22', 2, 6), /*  7 */
       ('2022-10-23', 5, 2), /*  8 */
       ('2022-10-23', 6, 5), /*  9 */
       ('2022-10-24', 9, 6), /* 10 */
       ('2022-12-22', 7, 6), /* 11 */
       ('2022-10-28', 3, 7), /* 12 */
       ('2022-10-28', 2, 8), /* 13 */
       ('2022-10-28', 4, 9), /* 14 */
       ('2022-11-02', 6, 9), /* 15 */
       ('2022-11-02', 7, 1), /* 16 */
       ('2022-11-02', 8, 2), /* 17 */
       ('2022-11-02', 10, 2), /* 18 */
       ('2022-11-03', 5, 5), /* 19 */
       ('2022-11-03', 9, 7), /* 20 */
       ('2022-11-03', 6, 7); /* 21 */
